<?php

// sort() - قم بفرز المصفوفات بترتيب تصاعدي
// rsort() - قم بفرز المصفوفات بترتيب تنازلي

// ksort() - قم بفرز المصفوفات ذات الصلة بطريقة تصاعدية وفقًا للمفتاح
// krsort() - قم بفرز المصفوفات ذات الصلة بطريقة تنازلية وفقًا للمفتاح

// asort() - قم بفرز المصفوفات ذات الصلة بطريقة تصاعدية وفقًا للقيمة
// arsort() - قم بفرز المصفوفات ذات الصلة بطريقة تنازلية وفقًا للقيمة


$numbers = [10, 14, 40, 77, 100, 4, 1];

$city = [
    "a" => "Irbid",
    "b" => "Amman",
    "c" => "Zarqa",
    "z" => "Jeddah"
];
krsort($city);

print_r($city);
